; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v9 ?v2)
             (pred_3 ?v6 ?v12)
             (pred_4 ?v9 ?v12)
             (pred_2 ?v11 ?v9 )
	     (pred_8 ?v9)
             (pred_9 ?v3)
             (pred_5 ?v6)
             (pred_10 ?v12)
             (pred_6 ?v9)
             (pred_12 ?v6)
             (pred_7 ?v9)
             (pred_11 ))



(:action op_5
:parameters (?v13 ?v1 ?v8 ?v5)
:precondition (and (pred_9 ?v13) (pred_9 ?v1) (pred_5 ?v8) (pred_10 ?v5)
          (pred_1 ?v13 ?v1) (pred_3 ?v8 ?v5)
                   (pred_4 ?v1 ?v5) (pred_8 ?v13) 
                   (pred_6 ?v1) (pred_12 ?v8))
:effect (and  (pred_7 ?v1) (not (pred_6 ?v1))))


(:action op_3
:parameters (?v13 ?v7)
:precondition (and (pred_9 ?v13) (pred_9 ?v7)
               (pred_8 ?v13) (pred_1 ?v13 ?v7) (pred_7 ?v7))
:effect (and (pred_8 ?v7) (not (pred_8 ?v13))))

(:action op_1
:parameters (?v13 ?v8)
:precondition (and (pred_9 ?v13) (pred_5 ?v8) 
                  (pred_8 ?v13) (pred_2 ?v8 ?v13) (pred_11 ))
:effect (and (pred_12 ?v8)
   (not (pred_2 ?v8 ?v13)) (not (pred_11 ))))


(:action op_2
:parameters (?v13 ?v10 ?v4)
:precondition (and (pred_9 ?v13) (pred_5 ?v10) (pred_5 ?v4)
                  (pred_8 ?v13) (pred_12 ?v4) (pred_2 ?v10 ?v13))
:effect (and (pred_12 ?v10) (pred_2 ?v4 ?v13)
        (not (pred_12 ?v4)) (not (pred_2 ?v10 ?v13))))

(:action op_4
:parameters (?v13 ?v8)
:precondition (and (pred_9 ?v13) (pred_5 ?v8) 
                  (pred_8 ?v13) (pred_12 ?v8))
:effect (and (pred_11 ) (pred_2 ?v8 ?v13) (not (pred_12 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_01 obj_05 obj_30 obj_17 obj_19 obj_09 obj_26 obj_18 obj_20 obj_23 obj_14 obj_21 obj_07 obj_16 obj_29 obj_24 obj_25 obj_02 obj_28 obj_27 obj_13 obj_04 obj_10 obj_03
    obj_06 obj_08
    obj_12 obj_11 obj_22
    )

    (:init
       (pred_11)

       (pred_9 obj_15)
       (pred_9 obj_01)
       (pred_9 obj_05)
       (pred_9 obj_30)
       (pred_9 obj_17)
       (pred_9 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_26)
       (pred_9 obj_18)
       (pred_9 obj_20)
       (pred_9 obj_23)
       (pred_9 obj_14)
       (pred_9 obj_21)
       (pred_9 obj_07)
       (pred_9 obj_16)
       (pred_9 obj_29)
       (pred_9 obj_24)
       (pred_9 obj_25)
       (pred_9 obj_02)
       (pred_9 obj_28)
       (pred_9 obj_27)
       (pred_9 obj_13)
       (pred_9 obj_04)
       (pred_9 obj_10)
       (pred_9 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_08)
       (pred_5 obj_12)
       (pred_5 obj_11)
       (pred_5 obj_22)

       (pred_1 obj_15 obj_19)
       (pred_1 obj_15 obj_01)
       (pred_1 obj_01 obj_09)
       (pred_1 obj_01 obj_05)
       (pred_1 obj_01 obj_15)
       (pred_1 obj_05 obj_26)
       (pred_1 obj_05 obj_30)
       (pred_1 obj_05 obj_01)
       (pred_1 obj_30 obj_18)
       (pred_1 obj_30 obj_17)
       (pred_1 obj_30 obj_05)
       (pred_1 obj_17 obj_20)
       (pred_1 obj_17 obj_30)
       (pred_1 obj_19 obj_23)
       (pred_1 obj_19 obj_09)
       (pred_1 obj_19 obj_15)
       (pred_1 obj_09 obj_14)
       (pred_1 obj_09 obj_26)
       (pred_1 obj_09 obj_01)
       (pred_1 obj_09 obj_19)
       (pred_1 obj_26 obj_21)
       (pred_1 obj_26 obj_18)
       (pred_1 obj_26 obj_05)
       (pred_1 obj_26 obj_09)
       (pred_1 obj_18 obj_07)
       (pred_1 obj_18 obj_20)
       (pred_1 obj_18 obj_30)
       (pred_1 obj_18 obj_26)
       (pred_1 obj_20 obj_16)
       (pred_1 obj_20 obj_17)
       (pred_1 obj_20 obj_18)
       (pred_1 obj_23 obj_29)
       (pred_1 obj_23 obj_14)
       (pred_1 obj_23 obj_19)
       (pred_1 obj_14 obj_24)
       (pred_1 obj_14 obj_21)
       (pred_1 obj_14 obj_09)
       (pred_1 obj_14 obj_23)
       (pred_1 obj_21 obj_25)
       (pred_1 obj_21 obj_07)
       (pred_1 obj_21 obj_26)
       (pred_1 obj_21 obj_14)
       (pred_1 obj_07 obj_02)
       (pred_1 obj_07 obj_16)
       (pred_1 obj_07 obj_18)
       (pred_1 obj_07 obj_21)
       (pred_1 obj_16 obj_28)
       (pred_1 obj_16 obj_20)
       (pred_1 obj_16 obj_07)
       (pred_1 obj_29 obj_27)
       (pred_1 obj_29 obj_24)
       (pred_1 obj_29 obj_23)
       (pred_1 obj_24 obj_13)
       (pred_1 obj_24 obj_25)
       (pred_1 obj_24 obj_14)
       (pred_1 obj_24 obj_29)
       (pred_1 obj_25 obj_04)
       (pred_1 obj_25 obj_02)
       (pred_1 obj_25 obj_21)
       (pred_1 obj_25 obj_24)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_02 obj_28)
       (pred_1 obj_02 obj_07)
       (pred_1 obj_02 obj_25)
       (pred_1 obj_28 obj_03)
       (pred_1 obj_28 obj_16)
       (pred_1 obj_28 obj_02)
       (pred_1 obj_27 obj_13)
       (pred_1 obj_27 obj_29)
       (pred_1 obj_13 obj_04)
       (pred_1 obj_13 obj_24)
       (pred_1 obj_13 obj_27)
       (pred_1 obj_04 obj_10)
       (pred_1 obj_04 obj_25)
       (pred_1 obj_04 obj_13)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_10 obj_04)
       (pred_1 obj_03 obj_28)
       (pred_1 obj_03 obj_10)
       (pred_6 obj_18)
       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_4  obj_18 obj_06)
       (pred_4  obj_16 obj_08)
       (pred_4  obj_09 obj_08)
       (pred_7 obj_15)
       (pred_7 obj_01)
       (pred_7 obj_05)
       (pred_7 obj_30)
       (pred_7 obj_17)
       (pred_7 obj_19)
       (pred_7 obj_26)
       (pred_7 obj_20)
       (pred_7 obj_23)
       (pred_7 obj_14)
       (pred_7 obj_21)
       (pred_7 obj_07)
       (pred_7 obj_29)
       (pred_7 obj_24)
       (pred_7 obj_25)
       (pred_7 obj_02)
       (pred_7 obj_28)
       (pred_7 obj_27)
       (pred_7 obj_13)
       (pred_7 obj_04)
       (pred_7 obj_10)
       (pred_7 obj_03)

       (pred_3  obj_12 obj_06)
       (pred_3  obj_11 obj_08)
       (pred_3  obj_22 obj_08)
       (pred_2 obj_12 obj_07)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_22 obj_21)
       (pred_8 obj_30)
    )

    (:goal (and
       (pred_2 obj_11 obj_14)
       (pred_2 obj_22 obj_23)
    ))
(:constraints
  (always (not (pred_8 obj_26)))
)
)

; plan
1. (op_3 obj_30 obj_05)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_05)
   goals met: 0 of 2
2. (op_3 obj_05 obj_01)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_01)
   goals met: 0 of 2
3. (op_3 obj_01 obj_15)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_15)
   goals met: 0 of 2
4. (op_3 obj_15 obj_19)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_19)
   goals met: 0 of 2
5. (op_3 obj_19 obj_23)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_23)
   goals met: 0 of 2
6. (op_3 obj_23 obj_14)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_14)
   goals met: 0 of 2
7. (op_3 obj_14 obj_21)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_21)
   goals met: 0 of 2
8. (op_3 obj_21 obj_07)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_07)
   goals met: 0 of 2
9. (op_3 obj_07 obj_02)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_02)
   goals met: 0 of 2
10. (op_1 obj_02 obj_11)
   deleted: (pred_2 obj_11 obj_02) (pred_11)
   added: (pred_12 obj_11)
   goals met: 0 of 2
11. (op_3 obj_02 obj_07)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_07)
   goals met: 0 of 2
12. (op_3 obj_07 obj_21)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_21)
   goals met: 0 of 2
13. (op_3 obj_21 obj_14)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_14)
   goals met: 0 of 2
14. (op_4 obj_14 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_11) (pred_2 obj_11 obj_14)
   goals met: 1 of 2
15. (op_3 obj_14 obj_21)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_21)
   goals met: 1 of 2
16. (op_1 obj_21 obj_22)
   deleted: (pred_2 obj_22 obj_21) (pred_11)
   added: (pred_12 obj_22)
   goals met: 1 of 2
17. (op_3 obj_21 obj_14)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_14)
   goals met: 1 of 2
18. (op_3 obj_14 obj_23)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_23)
   goals met: 1 of 2
19. (op_4 obj_23 obj_22)
   deleted: (pred_12 obj_22)
   added: (pred_11) (pred_2 obj_22 obj_23)
   goals met: 2 of 2
